flipperdevices/flipperzero-firmware/applications/external/totp/lib/wolfssl/wolfcrypt/src/port/pic32/pic32mz-crypt.c
        /* Clear the interrupt flags */
        CEINTSRC = 0xF;

        /* Run the engine */
        CEBDPADDR = (unsigned int)KVA_TO_PA(&bd);
        CEINTEN = 0x07; /* enable DMA Packet Completion Interrupt */

        /* input swap, enable BD fetch and start DMA */
    #if PIC32_NO_OUT_SWAP
        CECON = 0x25;
    #else
        CECON = 0xa5; /* bit 7 = enable out swap */
    #endif

        /* wait for operation to complete */
        while (CEINTSRCbits.PKTIF == 0 && --timeout > 0) {};

        /* Clear the interrupt flags */
        CEINTSRC = 0xF;

        /* check for errors */
        if (CESTATbits.ERROP || timeout <= 0) {
        #if 0
            printf("PIC32 Crypto: ERROP %x, ERRPHASE %x, TIMEOUT %s\n",
                CESTATbits.ERROP, CESTATbits.ERRPHASE, timeout <= 0 ? "yes" : "no");
        #endif
            ret = ASYNC_OP_E;
        }

        wolfSSL_CryptHwMutexUnLock();

        /* copy result to output */
    #if PIC32_NO_OUT_SWAP
        /* swap bytes */
        ByteReverseWords(out, (word32*)out_p, outLen);
    #elif defined(_SYS_DEVCON_LOCAL_H)
        /* sync cache */
        SYS_DEVCON_DataCacheInvalidate((word32)out, outLen);
    #else
        XMEMCPY(out, out_p, outLen);
    #endif
    }

    /* handle unaligned */
    if (isDynamic) {
        /* return result */
        XMEMCPY(pOut, out, outLen);

        /* free dynamic buffers */
        XFREE(in, NULL, DYNAMIC_TYPE_AES_BUFFER);
        if ((word32*)pIn != pOut)
            XFREE(out, NULL, DYNAMIC_TYPE_AES_BUFFER);
    }

    return ret;
}
#endif /* WOLFSSL_PIC32MZ_CRYPT || WOLFSSL_PIC32MZ_HASH */


#ifdef WOLFSSL_PIC32MZ_HASH

#ifdef WOLFSSL_PIC32MZ_LARGE_HASH

/* tunable large hash block size */
#ifndef PIC32_BLOCK_SIZE
    #define PIC32_BLOCK_SIZE 256
#endif

#define PIC32MZ_MIN_BLOCK    64
#define PIC32MZ_MAX_BLOCK    (32*1024)

#ifndef PIC32MZ_MAX_BD
    #define PIC32MZ_MAX_BD   2
#endif

#if PIC32_BLOCK_SIZE < PIC32MZ_MIN_BLOCK
    #error Encryption block size must be at least 64 bytes.
#endif

/* Crypt Engine descriptor */
typedef struct {
    int currBd;
    int err;
    unsigned int msgSize;
    uint32_t processed;
    uint32_t dbPtr;
    int engine_ready;
    volatile bufferDescriptor   bd[PIC32MZ_MAX_BD] __attribute__((aligned (8)));
    securityAssociation         sa                 __attribute__((aligned (8)));
} pic32mz_desc;

static pic32mz_desc gLHDesc __attribute__((coherent));
static uint8_t gLHDataBuf[PIC32MZ_MAX_BD][PIC32_BLOCK_SIZE] __attribute__((aligned (4), coherent));

static void reset_engine(int algo)
{
    int i;

    wolfSSL_CryptHwMutexLock();

    /* Software reset */
    CECON = 1 << 6;
    while (CECON);

    /* Clear the interrupt flags */
    CEINTSRC = 0xF;

    /* Make sure everything is clear first before we setup */
    XMEMSET(&gLHDesc, 0, sizeof(pic32mz_desc));

    /* Set up the Security Association */
    gLHDesc.sa.SA_CTRL.ALGO = algo;
    gLHDesc.sa.SA_CTRL.LNC = 1;
    gLHDesc.sa.SA_CTRL.FB = 1;
    gLHDesc.sa.SA_CTRL.ENCTYPE = 1;
    gLHDesc.sa.SA_CTRL.LOADIV = 1;

    /* Set up the Buffer Descriptor */
    gLHDesc.err = 0;
    for (i = 0; i < PIC32MZ_MAX_BD; i++) {
        XMEMSET((void *)&gLHDesc.bd[i], 0, sizeof(gLHDesc.bd[i]));
        gLHDesc.bd[i].BD_CTRL.LAST_BD = 1;
        gLHDesc.bd[i].BD_CTRL.LIFM = 1;
        gLHDesc.bd[i].BD_CTRL.PKT_INT_EN = 1;
        gLHDesc.bd[i].SA_ADDR = KVA_TO_PA(&gLHDesc.sa);
        gLHDesc.bd[i].SRCADDR = KVA_TO_PA(&gLHDataBuf[i]);
        if (PIC32MZ_MAX_BD > i+1)
            gLHDesc.bd[i].NXTPTR = KVA_TO_PA(&gLHDesc.bd[i+1]);
        else
            gLHDesc.bd[i].NXTPTR = KVA_TO_PA(&gLHDesc.bd[0]);
        XMEMSET((void *)&gLHDataBuf[i], 0, PIC32_BLOCK_SIZE);
    }
    gLHDesc.bd[0].BD_CTRL.SA_FETCH_EN = 1; /* Fetch the security association on the first BD */
    gLHDesc.dbPtr = 0;
    gLHDesc.currBd = 0;
    gLHDesc.msgSize = 0;
    gLHDesc.processed = 0;
    CEBDPADDR = KVA_TO_PA(&(gLHDesc.bd[0]));

    CEPOLLCON = 10;

#if PIC32_NO_OUT_SWAP
    CECON = 0x27;
#else
    CECON = 0xa7;
#endif
}

static void update_engine(const byte *input, word32 len, word32 *hash)
{
    int total;
    
    gLHDesc.bd[gLHDesc.currBd].UPDPTR = KVA_TO_PA(hash);

    /* Add the data to the current buffer. If the buffer fills, start processing it
       and fill the next one. */
    while (len) {
        /* If we've been given the message size, we can process along the
           way.
           Enable the current buffer descriptor if it is full. */
        if (gLHDesc.dbPtr >= PIC32_BLOCK_SIZE) {
            /* Wrap up the buffer descriptor and enable it so the engine can process */
            gLHDesc.bd[gLHDesc.currBd].MSGLEN = gLHDesc.msgSize;
            gLHDesc.bd[gLHDesc.currBd].BD_CTRL.BUFLEN = gLHDesc.dbPtr;
            gLHDesc.bd[gLHDesc.currBd].BD_CTRL.LAST_BD = 0;
            gLHDesc.bd[gLHDesc.currBd].BD_CTRL.LIFM = 0;
            gLHDesc.bd[gLHDesc.currBd].BD_CTRL.DESC_EN = 1;
            /* Move to the next buffer descriptor, or wrap around. */
            gLHDesc.currBd++;
            if (gLHDesc.currBd >= PIC32MZ_MAX_BD)
                gLHDesc.currBd = 0;
            /* Wait until the engine has processed the new BD. */
            while (gLHDesc.bd[gLHDesc.currBd].BD_CTRL.DESC_EN);
            gLHDesc.bd[gLHDesc.currBd].UPDPTR = KVA_TO_PA(hash);
            gLHDesc.dbPtr = 0;
        }
        if (!PIC32MZ_IF_RAM(input)) {
            /* If we're inputting from flash, let the BD have
               the address and max the buffer size */
            gLHDesc.bd[gLHDesc.currBd].SRCADDR = KVA_TO_PA(input);
            total = (len > PIC32MZ_MAX_BLOCK ? PIC32MZ_MAX_BLOCK : len);
            gLHDesc.dbPtr = total;
            len -= total;
            input += total;
        }
        else {
            if (len > PIC32_BLOCK_SIZE - gLHDesc.dbPtr) {
                /* We have more data than can be put in the buffer. Fill what we can.*/
                total = PIC32_BLOCK_SIZE - gLHDesc.dbPtr;
                XMEMCPY(&gLHDataBuf[gLHDesc.currBd][gLHDesc.dbPtr], input, total);
                len -= total;
                gLHDesc.dbPtr = PIC32_BLOCK_SIZE;
                input += total;
            }
            else {
                /* Fill up what we have, but don't turn on the engine.*/
                XMEMCPY(&gLHDataBuf[gLHDesc.currBd][gLHDesc.dbPtr], input, len);
                gLHDesc.dbPtr += len;
                len = 0;
            }
        }
    }
}

static void start_engine(void)
{
    /* Wrap up the last buffer descriptor and enable it */
    int bufferLen;

